app/views/comments/_form.html.erb

    <%= f.label :User %>
    <%= f.select :user_id, options_for_select(User.all.map{|c| [ c.name, c.id ] }), prompt: "Select a user" %>
---
SELECT "users".* FROM "users"

    <%= f.label :Project %>
    <%= f.select :project_id, options_for_select(Project.all.map{|c| [ c.name, c.id ] }), prompt: "Select a project" %>
---
SELECT "projects".* FROM "projects"