app/views/rewards/_form.html.erb

    <%= f.label :Project %>
    <%= f.select :project_id, options_for_select(Project.all.map{|c| [ c.name, c.id ] }), prompt: "Select a project" %>
---
SELECT "projects".* FROM "projects"