app/views/users/show.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 6]]
---
    <ul class="user-projects">
      <% @user.projects.each do |project| %>