app/views/home/index.html.erb

  <div class="project">
    <% if Project.first %>
---
SELECT  "projects".* FROM "projects" ORDER BY "projects"."id" ASC LIMIT $1  [["LIMIT", 1]]