app/views/projects/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :User %>
    <%= f.select :user_id, options_for_select(User.all.map{|c| [ c.name, c.id ] }), prompt: "Select a user" %>