app/views/projects/show.html.erb

    <h2>Pledges</h2>
      <% @project.rewards.each do |reward| %>
---
SELECT "rewards".* FROM "rewards" WHERE "rewards"."project_id" = $1  [["project_id", 1]]