app/views/follows/new.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :Follower %>
    <%= f.select :follower_id, options_for_select(User.all.map{|c| [ c.name, c.id ] }), prompt: "Select a user" %>