app/controllers/comments_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "created_at", "updated_at", "user_id", "project_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "hpña"], ["created_at", 2017-05-14 05:36:36 UTC], ["updated_at", 2017-05-14 05:36:36 UTC], ["user_id", 2], ["project_id", 1]]
---
  def create
    @project = Project.find(params[:project_id])
    @comment = @project.comments.build(content: comment_params[:content], user_id: @current_user.id)
    respond_to do |format|
      if @comment.save