app/controllers/follows_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "follows" ("following_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["following_id", 3], ["follower_id", 1], ["created_at", 2017-05-14 21:55:37 UTC], ["updated_at", 2017-05-14 21:55:37 UTC]]
---
  def create
    @follow = Follow.new(pledge_params)
    follower = User.find(params[:follow][:follower_id])
    following = User.find(params[:follow][:following_id])
    respond_to do |format|
      if @follow.save