app/controllers/home_controller.rb

SELECT  "projects".* FROM "projects" ORDER BY "projects"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
  def index
    @projects = Project.all
    @response = get_tweets("nasa")
    @response["statuses"].each do |tweet|
      puts tweet["text"]
    end
    if params[:category]
      @projects = Project.where(category_id: params[:category])
      project = @projects.first