app/controllers/pledges_controller.rb

  def index
    @pledges = Pledge.all
---
SELECT "pledges".* FROM "pledges"

  def new
    if logged_in?
      @project = Project.find(params[:project_id])
      @reward = Reward.find(params[:reward_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "rewards".* FROM "rewards" WHERE "rewards"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @project = Project.find(pledge_params[:project_id])
    @reward = Reward.find(pledge_params[:reward_id])
    @pledge = Pledge.new(pledge_params)
    @pledge.user_id = @current_user.id


    respond_to do |format|
      if @pledge.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "rewards".* FROM "rewards" WHERE "rewards"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "pledges" ("amount", "created_at", "updated_at", "project_id", "user_id", "reward_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 0.1e4], ["created_at", 2017-05-14 22:28:34 UTC], ["updated_at", 2017-05-14 22:28:34 UTC], ["project_id", 1], ["user_id", 6], ["reward_id", 4]]