app/controllers/projects_controller.rb

  def index
    @categories = Category.all
    @projects = Project.all
    if params[:search]
      @projects = Project.search(params[:search])
    elsif params[:category] && params[:category].to_i != 0
      @projects = Project.where(category_id: params[:category].to_i)
    else
      @projects = Project.all.order('created_at DESC')
    end
    @projects = @projects.paginate(:page => params[:page], :per_page => 9)
---
SELECT "categories".* FROM "categories"
SELECT  "projects".* FROM "projects" ORDER BY "projects"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."category_id" = $1  [["category_id", 3]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @project = @current_user.projects.new(project_params)

    respond_to do |format|
      if @project.save
        (Follow.where(following_id: @current_user.id)).each do |query_result|
          to_user = User.find(query_result.follower_id)
---
INSERT INTO "projects" ("name", "description", "start_date", "end_date", "created_at", "updated_at", "user_id", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def set_rewards
      @rewards = Reward.search(params[:id])
---
SELECT "rewards".* FROM "rewards" WHERE "rewards"."project_id" = $1  [["project_id", 12]]