app/controllers/rewards_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def index
    @project = Project.find(params[:search])

INSERT INTO "rewards" ("title", "amount", "description", "created_at", "updated_at", "project_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "r1"], ["amount", 321.0], ["description", "dsadsa"], ["created_at", 2017-05-14 05:51:21 UTC], ["updated_at", 2017-05-14 05:51:21 UTC], ["project_id", 1]]
---
  def create
    @reward = Reward.new(reward_params)

    respond_to do |format|
      if @reward.save

SELECT  "rewards".* FROM "rewards" WHERE "rewards"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_reward
      @reward = Reward.find(params[:id])