app/controllers/sessions_controller.rb

  def create
    #log_in @user
    user = User.find_by(email: params[:session][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "email@uc.cl"], ["LIMIT", 1]]