app/controllers/users_controller.rb

  def index
    @users = User.all
    current_user = User.find_by_id(session[:current_user_id])
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"